backend/controllers/BlogController.php

	public function actionArticle ()
    {
		$title = Title::getTitle('article');
		$query = Article::find();
		$query->where(BackFilter::whereRule('article'));
		$page = new Pagination(['totalCount' => $query->count('id')]);
---
SELECT COUNT(id) FROM `article`

	public function actionContentbrowse ()
	{
		$articleid = $this->request->get("articleid");
		$articleModel = Article::findOne($articleid);
---
SELECT * FROM `article` WHERE `id`='52'