service/models/version1/Article.php

	public function handleValue($value)
	{
		if (false == $this->handleValue) return $value;

		if ($value['image']) $value['image'] = $this->imageDomain . $value['image'];

		$value['label'] = $this->articleLabels($value);
		$author = User::findOne($value['author']);
---
SELECT * FROM `m_user` WHERE `id` IS NULL