backend/models/Article.php

	public function getArticleById ($articleid,$cache = true)
	{
		if (!$articleid) return [];

		if ($cache) {
			static $article;
			if ($article[$articleid]) return $article[$articleid];
		}
		$article[$articleid] = self::findOne($articleid);
---
SELECT * FROM `article` WHERE `id`='74'