backend/models/Label.php

SELECT * FROM `label` WHERE 1=1 ORDER BY `id`
---
	public static function selectTree ($condition = '1=1')
	{
		$query = self::find()->where($condition)->orderBy('id');
		$data = $query->asArray()->all();//dump($data);

SELECT `id`, `name` FROM `label` WHERE (`level` LIKE '-0-24-16-%') AND (1=1)
---
	public static function labelTree ($label_id,$condition = '1=1')
	{
		if (!$label_id || !($labelInfo = static::getInfoById($label_id))) return [];
		$query = static::find();
		$query->select(['id','name']);
		$query->where(['and',['like','level',$labelInfo['level'] . $labelInfo['id'] . '-' . '%',false]])->andWhere($condition);
		$list = $query->asArray()->all();