backend/models/UserAdmin.php

	public static function findIdentity($id)
	{
		return static::findOne($id);
---
SELECT * FROM `m_user` WHERE `id`=1

	static function getByUsername ($username)
	{
		if (!$username) return false;
		return static::findOne(['username' => $username]);
---
SELECT * FROM `m_user` WHERE `username`='qjx'